--1.	Разработайте простейший анонимный блок PL/SQL (АБ), не содержащий операторов.



--2.	Разработайте АБ, выводящий «Hello World!». Выполните его в SQLDev и SQL+.
--3.	Продемонстрируйте работу исключения и встроенных функций sqlerrm, sqlcode.
--4.	Разработайте вложенный блок. Продемонстрируйте принцип обработки исключений во вложенных блоках.
--5.	Выясните, какие типы предупреждения компилятора поддерживаются в данный момент.
--6.	Разработайте скрипт, позволяющий просмотреть все спецсимволы PL/SQL.
--7.	Разработайте скрипт, позволяющий просмотреть все ключевые слова  PL/SQL.
--8.	Разработайте скрипт, позволяющий просмотреть все параметры Oracle Server, связанные с PL/SQL. Просмотрите эти же параметры с помощью SQL+-команды show.
--9.	Разработайте анонимный блок, демонстрирующий (выводящий в выходной серверный поток результаты):
--10.	объявление и инициализацию целых number-переменных;
--11.	арифметические действия над двумя целыми number-переменных, включая деление с остатком;
--12.	объявление и инициализацию number-переменных с фиксированной точкой;
--13.	объявление и инициализацию number-переменных с фиксированной точкой и отрицательным масштабом (округление);
--14.	объявление и инициализацию BINARY_FLOAT-переменной;
--15.	объявление и инициализацию BINARY_DOUBLE-переменной;
--16.	объявление number-переменных с точкой и применением символа E (степень 10) при инициализации/присвоении;
--17.	объявление и инициализацию BOOLEAN-переменных. 
--18.	Разработайте анонимный блок PL/SQL содержащий объявление констант (VARCHAR2, CHAR, NUMBER). Продемонстрируйте  возможные операции константами.  
--19.	Разработайте АБ, содержащий объявления с опцией %TYPE. Продемонстрируйте действие опции.
--20.	Разработайте АБ, содержащий объявления с опцией %ROWTYPE. Продемонстрируйте действие опции.
--21.	Разработайте АБ, демонстрирующий все возможные конструкции оператора IF .
--22.	Разработайте АБ, демонстрирующий все возможные конструкции оператора IF .
--23.	Разработайте АБ, демонстрирующий работу оператора CASE.
--24.	Разработайте АБ, демонстрирующий работу оператора LOOP.
--25.	Разработайте АБ, демонстрирующий работу оператора WHILE.
--26.	Разработайте АБ, демонстрирующий работу оператора FOR.
